tap "cue-lang/tap"
tap "cuelang/tap"
tap "gcenx/wine"
tap "itchyny/tap"
tap "leopard-gecko/game"
brew "openssl@3"
brew "bat"
brew "blueutil"
brew "broot"
brew "btop"
brew "xz"
brew "tmux"
brew "byobu"
brew "cmake"
brew "colima", restart_service: :changed
brew "colordiff"
brew "curl"
brew "docker"
brew "docker-compose"
brew "dust"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "openjdk"
brew "gradle"
brew "htop"
brew "libomp"
brew "maven"
brew "nano"
brew "ncdu"
brew "neovim"
brew "node"
brew "nodebrew"
brew "pipx"
brew "poetry"
brew "poppler"
brew "protobuf"
brew "pure"
brew "pyenv"
brew "python@3.10"
brew "python-tk@3.10"
brew "python@3.13"
brew "recon-ng"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rustup"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tesseract"
brew "tesseract-lang"
brew "tree"
brew "wget"
brew "winetricks"
brew "xcodes"
brew "yarn"
brew "leopard-gecko/game/jrogue"
cask "brave-browser"
cask "codex"
cask "font-blex-mono-nerd-font"
cask "font-fira-code"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "kiro"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "obsidian"
cask "slack"
cask "sonic-visualiser"
cask "tuxguitar"
cask "visual-studio-code"
cask "vnc-viewer"
cask "warp"
cask "gcenx/wine/wine-crossover"
cask "zed"
vscode "davidanson.vscode-markdownlint"
vscode "jamesmaj.easy-icons"
vscode "janisdd.vscode-edit-csv"
vscode "johnpapa.vscode-peacock"
vscode "kino6.markdown-studio-local"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mgesbert.python-path"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "starkwang.markdown"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
npm "@anthropic-ai/claude-code"
npm "@vscode/vsce"
npm "corepack"
